Project/Toir.Adaptation/src/Documents/торо_УчетКонтролируемыхПоказателей/торо_УчетКонтролируемыхПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_УчетКонтролируемыхПоказателей</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>InformationRegister.торо_ЗначенияКонтролируемыхПоказателей</registerRecords>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="17acea66-f6c9-487b-a647-e9cc33ee27ab">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="d76ccf21-2b19-452e-9028-4edb77481e00">
    <name>Показатели</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/InformationRegisters/торо_ОчередьУведомлений/торо_ОчередьУведомлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="05bc7005-d271-4d0f-b978-6222cabdae7e">
  <name>торо_ОчередьУведомлений</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="c3b14dd5-d2d8-44f5-9a6a-fb1a98b70549">
    <name>ТемаПисьма</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="e3558519-e6a8-4b99-8f7c-9ccdc68cc619">
    <name>ТелоПисьма</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="f406dd60-181a-49b4-b5f3-066d4214c6ed">
    <name>ОписаниеОшибки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="a2afda4c-62a0-4acd-b681-a3d6cfd51238">
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="cfca17f5-e0b8-4af8-9a61-550dda4d9180">
    <name>ID_уведомления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="6df3c419-054f-4c0b-97fb-0e373cda0788">
    <name>СпособУведомления</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="33d9092d-8133-4d9d-906c-992514b33041">
    <name>Источник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ИзмеряемыеПоказателиОбъектовРемонта/торо_ИзмеряемыеПоказателиОбъектовРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ИзмеряемыеПоказателиОбъектовРемонта</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>КритическийМинимум</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>КритическийМаксимум</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ДопустимыйМинимум</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ДопустимыйМаксимум</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes>
    <name>ТочкаЗамера</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЗначенияКонтролируемыхПоказателейИзОР</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Удален</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Documents/торо_УчетКонтролируемыхПоказателей/ObjectModule.bsl
#Область ОбработчикиСобытий

&После("ОбработкаУдаленияПроведения")
Процедура Расш_гкс_ОбработкаУдаленияПроведения(Отказ)
	НаборЗаписей = РегистрыСведений.торо_ДокументыДляПроверкиТребованийФМ.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПроверяемыйДокумент.Установить(Ссылка);
	НаборЗаписей.Записать();
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура Расш_гкс_ОбработкаПроведения(Отказ, Режим)
	Если Не Отказ Тогда 
		НаборЗаписей = РегистрыСведений.торо_ДокументыДляПроверкиТребованийФМ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПроверяемыйДокумент.Установить(Ссылка);
		НоваяСтрока = НаборЗаписей.Добавить();
		НоваяСтрока.Период = Дата;
		НоваяСтрока.ПроверяемыйДокумент = Ссылка;
		НаборЗаписей.Записать();
	КонецЕсли;
	
	Если Не Отказ И ДополнительныеСвойства.Свойство("гкс_ДанныеДляОтправкиОтветственному") Тогда
		гкс_ОтправитьПисьмоОтветственномуЗаПоказатели();		
	КонецЕсли;	
		
КонецПроцедуры

&Перед("ПередЗаписью")
Процедура гкс_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		гкс_СформироватьТаблицуПоказателей();
	КонецЕсли;
		
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура гкс_ОтправитьПисьмоОтветственномуЗаПоказатели()

	ОтветственныеЗаПоказатели = гкс_ОтветственныеЗаПоказатели();
	Если ОтветственныеЗаПоказатели.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ТемаПисьма = СтрШаблон("Превышение допустимых показателей по документу: Учет контролируемых показателей %1 от %2",
		Номер, Дата);
	ТелоПисьма = гкс_СформироватьТелоПисьма();

	Для Каждого Ответственный Из ОтветственныеЗаПоказатели Цикл
		МенеджерЗаписи = РегистрыСведений.торо_ОчередьУведомлений.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Пользователь = Ответственный;
		МенеджерЗаписи.ID_уведомления = Новый УникальныйИдентификатор;
		МенеджерЗаписи.СпособУведомления = Перечисления.торо_СпособыУведомленияПользователей.УведомлениеПоЭлектроннойПочте;
		МенеджерЗаписи.Источник = Ссылка;
		МенеджерЗаписи.ТемаПисьма = ТемаПисьма;
		МенеджерЗаписи.ТелоПисьма = ТелоПисьма;
		МенеджерЗаписи.Записать();
	КонецЦикла;

КонецПроцедуры		

Функция гкс_ОтветственныеЗаПоказатели()
	
	МассивОтветственных = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкаОповещенийПоПоказателямОР.Ответственный КАК Ответственный
		|ИЗ
		|	РегистрСведений.гкс_НастройкаОповещенийПоПоказателямОР КАК НастройкаОповещенийПоПоказателямОР
		|ГДЕ
		|	НастройкаОповещенийПоПоказателямОР.Организация = &Организация
		|	И НастройкаОповещенийПоПоказателямОР.Подразделение = &Подразделение";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивОтветственных.Добавить(ВыборкаДетальныеЗаписи.Ответственный);
	КонецЦикла;
	
	Возврат МассивОтветственных;
	
КонецФункции 

Процедура гкс_СформироватьТаблицуПоказателей()
	
	//отправляем письма только по числовым значениям, другие значения не используются
	Для Каждого ТекСтрока Из Показатели Цикл
		Если Не ТипЗнч(ТекСтрока.Значение) = Тип("Число") Тогда			
			Возврат;
		КонецЕсли;	
	КонецЦикла; 
	
	Если ЭтоНовый() Тогда
    	ТаблицаПоказателей = Показатели.Выгрузить(,"НомерСтроки,ОбъектРемонта,Показатель,Значение");		
	Иначе 
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Показатели", Показатели);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.Текст = гкс_ТекстЗапросаТаблицаИзмененныхПоказателей();
				
		РезультатЗапроса = Запрос.Выполнить();
		ТаблицаПоказателей = РезультатЗапроса.Выгрузить();
	КонецЕсли;	
	
	Если ТаблицаПоказателей.Количество() > 0 Тогда
		гкс_ПодготовитьДанныеДляЭлектронногоПисьма(ТаблицаПоказателей);	
	КонецЕсли;	
	
КонецПроцедуры	

Процедура гкс_ПодготовитьДанныеДляЭлектронногоПисьма(ТаблицаПоказателей) 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаПоказателей", ТаблицаПоказателей);
	Запрос.Текст = гкс_ТекстЗапросаДанныеДляПисьмаОтветственному();
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДанныеДляОтправкиОтветственному = РезультатЗапроса.Выгрузить();
	Если ДанныеДляОтправкиОтветственному.Количество() > 0 Тогда
		ДополнительныеСвойства.Вставить("гкс_ДанныеДляОтправкиОтветственному", ДанныеДляОтправкиОтветственному);		
	КонецЕсли;		
	
КонецПроцедуры	

Функция гкс_СформироватьТелоПисьма()
	
	МассивСтрок = Новый Массив;
		
	НачалоПисьма = СтрШаблон(
		НСтр("ru = 'По организации ""%1"" и подразделению ""%2"" зарегистрировано превышение контролируемых показателей
		|по оборудованию (документ ""Учет контролируемых показателей"" %3 от %4): %5'"),
		Организация, Подразделение, Номер, Дата, Символы.ПС);
		
	МассивСтрок.Добавить(НачалоПисьма);	
		
	Для Каждого ТекСтрока Из ДополнительныеСвойства.гкс_ДанныеДляОтправкиОтветственному Цикл
		СтрокаПисьма = СтрШаблон(
			НСтр("ru = '- %1 / %2 / Значение из документа: %3 (Допустимый min/max: %4/%5; Критический min/max: %6/%7)'"), 
			ТекСтрока.ОбъектРемонта, ТекСтрока.Показатель, ТекСтрока.Значение, ТекСтрока.ДопустимыйМинимум,
			ТекСтрока.ДопустимыйМаксимум, ТекСтрока.КритическийМинимум, ТекСтрока.КритическийМаксимум);
			
		МассивСтрок.Добавить(СтрокаПисьма);	
	КонецЦикла;
		
	Возврат СтрСоединить(МассивСтрок, Символы.ПС);
	
КонецФункции

#Область ТекстыЗапросов

Функция гкс_ТекстЗапросаТаблицаИзмененныхПоказателей() 
	
	Возврат 
	"ВЫБРАТЬ
	|	Показатели.НомерСтроки КАК НомерСтроки,
	|	Показатели.ОбъектРемонта КАК ОбъектРемонта,
	|	Показатели.Показатель КАК Показатель,
	|	Показатели.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_НовыеЗначения
	|ИЗ
	|	&Показатели КАК Показатели
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетКонтролируемыхПоказателейПоказатели.ОбъектРемонта КАК ОбъектРемонта,
	|	УчетКонтролируемыхПоказателейПоказатели.Показатель КАК Показатель,
	|	УчетКонтролируемыхПоказателейПоказатели.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_ПредыдущиеЗначения
	|ИЗ
	|	Документ.торо_УчетКонтролируемыхПоказателей.Показатели КАК УчетКонтролируемыхПоказателейПоказатели
	|ГДЕ
	|	УчетКонтролируемыхПоказателейПоказатели.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НовыеЗначения.НомерСтроки КАК НомерСтроки,
	|	ВТ_НовыеЗначения.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТ_НовыеЗначения.Показатель КАК Показатель,
	|	ВТ_НовыеЗначения.Значение КАК Значение
	|ИЗ
	|	ВТ_НовыеЗначения КАК ВТ_НовыеЗначения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПредыдущиеЗначения КАК ВТ_ПредыдущиеЗначения
	|		ПО ВТ_НовыеЗначения.ОбъектРемонта = ВТ_ПредыдущиеЗначения.ОбъектРемонта
	|			И ВТ_НовыеЗначения.Показатель = ВТ_ПредыдущиеЗначения.Показатель
	|			И ВТ_НовыеЗначения.Значение = ВТ_ПредыдущиеЗначения.Значение
	|ГДЕ
	|	ВТ_ПредыдущиеЗначения.ОбъектРемонта ЕСТЬ NULL";

КонецФункции	

Функция гкс_ТекстЗапросаДанныеДляПисьмаОтветственному() 
	
	Возврат 
	"ВЫБРАТЬ
	|	ТаблицаПоказателей.НомерСтроки КАК НомерСтроки,
	|	ТаблицаПоказателей.ОбъектРемонта КАК ОбъектРемонта,
	|	ТаблицаПоказателей.Показатель КАК Показатель,
	|	ТаблицаПоказателей.Значение КАК Значение
	|ПОМЕСТИТЬ ВТДанныеТЧ
	|ИЗ
	|	&ТаблицаПоказателей КАК ТаблицаПоказателей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДанныеТЧ.НомерСтроки КАК НомерСтроки,
	|	ВТДанныеТЧ.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТДанныеТЧ.Показатель КАК Показатель,
	|	ВТДанныеТЧ.Значение КАК Значение,
	|	ЕСТЬNULL(ИзмеряемыеПоказателиОбъектовРемонта.ДопустимыйМинимум, 0) КАК ДопустимыйМинимум,
	|	ЕСТЬNULL(ИзмеряемыеПоказателиОбъектовРемонта.ДопустимыйМаксимум, 0) КАК ДопустимыйМаксимум,
	|	ЕСТЬNULL(ИзмеряемыеПоказателиОбъектовРемонта.КритическийМинимум, 0) КАК КритическийМинимум,
	|	ЕСТЬNULL(ИзмеряемыеПоказателиОбъектовРемонта.КритическийМаксимум, 0) КАК КритическийМаксимум
	|ПОМЕСТИТЬ ВТГраницыПоказателей
	|ИЗ
	|	ВТДанныеТЧ КАК ВТДанныеТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта КАК ИзмеряемыеПоказателиОбъектовРемонта
	|		ПО ВТДанныеТЧ.ОбъектРемонта = ИзмеряемыеПоказателиОбъектовРемонта.ОбъектРемонта
	|			И ВТДанныеТЧ.Показатель = ИзмеряемыеПоказателиОбъектовРемонта.Показатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТГраницыПоказателей.НомерСтроки КАК НомерСтроки,
	|	ВТГраницыПоказателей.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТГраницыПоказателей.Показатель КАК Показатель,
	|	ВТГраницыПоказателей.Значение КАК Значение,
	|	ВТГраницыПоказателей.ДопустимыйМинимум КАК ДопустимыйМинимум,
	|	ВТГраницыПоказателей.ДопустимыйМаксимум КАК ДопустимыйМаксимум,
	|	ВТГраницыПоказателей.КритическийМинимум КАК КритическийМинимум,
	|	ВТГраницыПоказателей.КритическийМаксимум КАК КритическийМаксимум,
	|	ВЫБОР
	|		КОГДА ВТГраницыПоказателей.Значение < ВТГраницыПоказателей.ДопустимыйМинимум
	|			ТОГДА ИСТИНА
	|		КОГДА ВТГраницыПоказателей.Значение < ВТГраницыПоказателей.КритическийМинимум
	|			ТОГДА ИСТИНА
	|		КОГДА ВТГраницыПоказателей.Значение > ВТГраницыПоказателей.ДопустимыйМаксимум
	|			ТОГДА ИСТИНА
	|		КОГДА ВТГраницыПоказателей.Значение > ВТГраницыПоказателей.КритическийМаксимум
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НарушеныГраницыПоказателей
	|ПОМЕСТИТЬ ВТПроверенныеДанные
	|ИЗ
	|	ВТГраницыПоказателей КАК ВТГраницыПоказателей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПроверенныеДанные.НомерСтроки КАК НомерСтроки,
	|	ВТПроверенныеДанные.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТПроверенныеДанные.Показатель КАК Показатель,
	|	ВТПроверенныеДанные.Значение КАК Значение,
	|	ВТПроверенныеДанные.ДопустимыйМинимум КАК ДопустимыйМинимум,
	|	ВТПроверенныеДанные.ДопустимыйМаксимум КАК ДопустимыйМаксимум,
	|	ВТПроверенныеДанные.КритическийМинимум КАК КритическийМинимум,
	|	ВТПроверенныеДанные.КритическийМаксимум КАК КритическийМаксимум
	|ИЗ
	|	ВТПроверенныеДанные КАК ВТПроверенныеДанные
	|ГДЕ
	|	ВТПроверенныеДанные.НарушеныГраницыПоказателей";
	
КонецФункции	

#КонецОбласти	

#КонецОбласти
